### 1 Question
Дар бораи рекурсия нависед. 
Рекурция функция мебошад ки да дрини хдш ран мекна  ва бисёр памьята мегира ки барои бисёр програмистом макул нест
### 2 Question
Closure(Замыкания) - ро бо мисолҳо фаҳмонед.

### 3 Question
Контейнерҳоро ба хотир оварда онҳоро нависед. 
tuple, - Ивазнашаванда дохил кардам намешава 
Set - уникальный елементора мегира 
дикщнерии - индехсо ном доран
стринг - стрингай

### 4 Question
Дар бораи lambda expression ва list comprehension нависед.
ба фикрм ами чзе ба тарзи кутох навистан да я хат
### 5 Question
Кадом методҳои модули datetime ва randome - ро медонед. Бо мисолҳо фаҳмонед.
strftime ин барои рузу хафтара хисоб кадан
 



### 1 Task
Write a Python program to insert an element at a specified position into a given list.
Напишите программу Python для вставки элемента в указанную позицию в заданный список.
[1, 1, 2, 3, 4, 4, 5, 1]
# input
    Enter an element: Sorbon
    Index: 3
# output
    [1, 1, 2, "Sorbon", 3, 4, 4, 5, 1]


### 2 Task
Write a Python program to convert a list of multiple integers into a single integer.
Напишите программу на Python для преобразования списка из нескольких целых чисел в одно целое число.
# input
    Sample list: [11, 33, 50]
# output
    Expected Output: 113350
list1=input().split()
i=0
res=""
while i<len(list1):
    res+=list1[i]
    i+=1

print(res)

### 3 Task
Create a python program to read line number N from the following file.
Создайте программу Python для чтения строки номер N из следующего файла.
my_file.txt -> Hello world
               TEST
               Tajikistan
               An apple
# input
    3
# otput
    Tajikistan

with open("file.txt", 'r') as file:
    b=int(input())
    a=file.readline()
print(a[b])

### 4 Task
Create a python program to generate a random password of the specified length.
Создайте программу Python для создания случайного пароля указанной длины.
# input
    Enter the desired password length: 12
# output
    Generated password: Xy#7pLm$9oR5

### 5 Task
Build a program that converts currency from one denomination to another.
Создайте программу, которая конвертирует валюту одного номинала в другой.
# input
    Enter the amount in TJS: 1
# output
    Rub -> 0.1193
    USD -> 10.8656
    EUR -> 11.7837
    UZ_SUM -> 0.0856
    

### 6 Task
Given a natural number N, find the sum of the numbers 1+1/1!+1/2!+1/3!+...+1/N!. The number of actions should be proportional to N.
По данному натуральному числу N найдите сумму чисел 1+1/1!+1/2!+1/3!+...+1/N!. Количество действий должно быть пропорционально N.
# input
    1
# output
    2

def fuctorial(a):
    m=1
    l=1
    while m<=a:
        l=l*m
        m+=1
    return 1
n=int(input())
k=int(input())
h=fuctorial(n)/(fuctorial(n-k)*fuctorial(k))
print(h) 
### 7 Task
Write a Python program for binary search of an ordered list.
Напишите программу на Python для двоичного поиска в упорядоченном списке.
# Example
    Ordered_binary_Search([0, 1, 3, 8, 14, 18, 19, 34, 52], 3) -> True
    Ordered_binary_Search([0, 1, 3, 8, 14, 18, 19, 34, 52], 17) -> False
my_list=[]
aziz=int(input())
s=0
for i in (my_list):
        
    if aziz==my_list:
      s+=1

   if s>0
        print(True)
    else:
        print(False)


### 8 Task
Write a Python program to replace each character of a word of length five and more with a hash character (#).
Напишите программу на Python, заменяющую каждый символ слова длиной пять и более символом решетки (#).
# input
    Count the lowercase letters in the said list of words:
# output
    ##### the ######### ####### in the said list of ######

a=input().split()
for i in a:
    if len(i)>5:
        for j in range(len(i)):
            print("#", end=" ")
    else:
        print("*", end=" ")


### 9 Task
Write a Python script to print a dictionary where the keys are numbers between 1 and N (both included) and the values are the square of the keys.
Напишите сценарий Python для печати словаря, в котором ключами являются числа от 1 до N (оба включены), а значениями являются квадраты ключей.
# input
    15
# output
    {1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100, 11: 121, 12: 144, 13: 169, 14: 196, 15: 225}



### 10 Task
Given a list of elements of any data types. Create a Python program to separate elements by their types and save them into a new dictionary.
The keys of a dictionary must be of a data type, and its element must be data belonging to that type.
Дан список элементов любых типов данных. Создайте программу Python для разделения элементов по их типам и сохранения их в новый словарь.
Ключи словаря должны иметь тип данных, а его элементом должны быть данные, принадлежащие этому типу.
# input
    1 hello True 12 Muhammad
# output
    {"int": [1,12], "str": ["hello", "Muhammad"], "bool": [True]}



